test.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action/><wsa:MessageID>urn:uuid:13b4acb4-cbed-4a44-9653-b0ec61887690</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>https://ukid.uat.uk.experian.com/EIHEndpoint</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-eae374ac-2b08-4085-b056-d7a978ab5bfe"><wsu:Created>2012-09-05T17:45:30Z</wsu:Created><wsu:Expires>2012-09-06T17:45:30Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" ValueType="ExperianWASP" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" wsu:Id="SecurityToken-360cdfd9-0664-4a65-a0f0-92a0229bf83a">4B-BE-1C-B6-99-06-01-49-62-41-00-91-75-D3-D1-DD-EE-A7-8F-16-48-04-91-E3-6D-FE-01-D8-63-43-D6-2D-67-01-67-F9-F2-BF-17-AA-C3-7E-BE-5C-6F-79-CD-F5-77-14-A3-DE-28-5A-A0-6E-EC-E8-6D-F1-95-72-3C-AD-7A-66-49-03-8D-6D-7E-78-F9-23-11-62-C3-D0-56-5E-88-FC-64-37-E7-36-CE-14-8B-CE-EC-99-EF-FB-ED-85-A3-FC-80-14-44-6E-08-5F-86-15-BD-3B-CD-32-81-FF-9F-52-19-54-AB-27-69-61-36-27-08-45-33-9F-26-03-7A-AB-7D-8D-A5-F1-F4-8B-06-61-9F-0D-52-CE-C1-C2-31-C0-6D-1D-E8-5D-DB-29-16-99-E4-AF-02-FE-44-67-D0-FF-31-CB-FB-AA-A6-1F-78-9A-7B-B1-4F-C3-1D-63-EA-ED-1D-BA-94-4E-18-6B-F0-32-F9-40-95-AE-75-96-D0-DF-A0-57-2F-99-88-FA-71-89-04-37-83-51-B0-BF-B6-68-4A-28-E6-6F-F4-9A-C9-14-8C-DC-93-8E-92-11-24-5A-80-F8-26-F7-96-96-E6-96-C5-C8-9F-B6-67-5E-74-90-E6-97-89-C4-C2-40-E3-F7-CD-DB-76-B5-B7-B3-23-C9-4D-C8-B0-81-B3-79-D4-50-4C-BD-10-FC-C3-EB-A9-1B-7E-B9-40-D6-54-29-53-73-A3-31-B8-E7-74-9E-28-7D-46-6B-0F-31-35-46-C8-BB-94-E2-CC-58-F2-6B-18-D1-6A-99-D1-6F-A2-ED-37-55-84-BF-67-C8-AF-16-B9-F2-8D-51-19-B0-CF-6A-F3-56-F6-32-9A-46-02-73-B0-28-83-36-0E-10-96-30-AE-46-63-38-42-BB-31-E9-5F-BE-37-A2-10-ED-64-58-04-E4-4C-D6-E0-3B-0A-C9-C0-E2-25-4D-D8-D7-09-E3-AA-8F-3D-5B-62-94-58-3A-85-2F-BF-C6-E4-12-A0-5D-B2-8B-69-83-73-C1-7E-32-D0-78-A1-B7-0C-7D-0A-D1-14-F8-33-2A-6D-AB-EC-10-A6-14-DD-8A-CA-81-68-23-8A-92-74-C7-13-98-F8-FC-F2-33-20-B4-0C-ED-00-80-DA-63-84-4B-B6-98-28-AF</wsse:BinarySecurityToken></wsse:Security></soap:Header><soap:Body><ExecuteRequest xmlns="http://schema.uk.experian.com/eih/2011/03"><EIHHeader xmlns="http://schema.uk.experian.com/eih/2011/03/EIHHeader"><ClientUser>ADL</ClientUser><ReferenceId>ADL1EXT46</ReferenceId></EIHHeader><ProcessConfigReference><ProcessConfigName>CRB Check</ProcessConfigName></ProcessConfigReference><ResponseType>Decision Only</ResponseType><Consent>Yes</Consent><PersonalData><Name><Forename>TEST</Forename><MiddleName></MiddleName><Surname>TEST</Surname></Name><BirthDate>1971-05-14</BirthDate></PersonalData><Addresses><Address><AddressDetail><FlatOrApartmentNumber></FlatOrApartmentNumber><HouseName></HouseName><HouseNumber>2</HouseNumber><Address1>2 CROWMERE CLOSE</Address1><Address2>CUDDINGTON</Address2><Address3>NORTHWICH</Address3><Address4>CHESHIRE</Address4><PostCode>CW8 2ZF</PostCode><Country>GB</Country></AddressDetail><TypeOfAddress>UK</TypeOfAddress><AddressStatus>Current</AddressStatus><ResidentFrom>2002-10-05</ResidentFrom><ResidentTo>2012-09-05</ResidentTo></Address></Addresses></ExecuteRequest></soap:Body></soap:Envelope>
